Documents/АктСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АктСверки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыПоРегиональнымСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовЗаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.РасшифровкаНачисленияЛьгот</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льготчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льгота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазовоеНачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегиональнаяСубсидия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктСверки/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	Перерасчет.Организация КАК Организация,
	    |	Перерасчет.ЛицевойСчет,
	    |	Перерасчет.Услуга,
	    |	Перерасчет.МесяцНачисления,
	    |	Перерасчет.Сумма КАК Сумма,
	    |	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
	    |	ЕСТЬNULL(РасчетыПоЛицевымСчетамОстатки.СуммаОстаток, 0) + ЕСТЬNULL(Перерасчет.Сумма, 0) КАК СуммаАванс,
	    |	Перерасчет.Период
	    |ПОМЕСТИТЬ ВременнаяТаблицаАвансы
	    |ИЗ
	    |	ВременнаяТаблицаПерерасчет КАК Перерасчет
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(&Период, ) КАК РасчетыПоЛицевымСчетамОстатки
	    |		ПО Перерасчет.Организация = РасчетыПоЛицевымСчетамОстатки.Организация
	    |			И Перерасчет.ЛицевойСчет = РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет
	    |			И Перерасчет.Услуга = РасчетыПоЛицевымСчетамОстатки.Услуга
	    |			И Перерасчет.МесяцНачисления = РасчетыПоЛицевымСчетамОстатки.МесяцНачисления
	    |ГДЕ
	    |	Перерасчет.Сумма < 0
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	    |	ВременнаяТаблицаАвансы.Организация КАК Организация,
	    |	ВременнаяТаблицаАвансы.ЛицевойСчет КАК ЛицевойСчет,
	    |	ВременнаяТаблицаАвансы.Услуга КАК Услуга,
	    |	ВременнаяТаблицаАвансы.МесяцНачисления КАК МесяцНачисления,
	    |	ВременнаяТаблицаАвансы.СуммаАванс КАК Сумма,
	    |	ВременнаяТаблицаАвансы.Период КАК Период,
	    |	NULL КАК ВидНачисления
	    |ИЗ
	    |	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
	    |ГДЕ
	    |	ВременнаяТаблицаАвансы.СуммаАванс < 0
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	    |	ВременнаяТаблицаАвансы.Организация,
	    |	ВременнаяТаблицаАвансы.ЛицевойСчет,
	    |	ВременнаяТаблицаАвансы.Услуга,
	    |	NULL,
	    |	-ВременнаяТаблицаАвансы.СуммаАванс,
	    |	ВременнаяТаблицаАвансы.Период,
	    |	NULL
	    |ИЗ
	    |	ВременнаяТаблицаАвансы КАК ВременнаяТаблицаАвансы
	    |ГДЕ
	    |	ВременнаяТаблицаАвансы.СуммаАванс < 0
	    |
	    |ОБЪЕДИНИТЬ ВСЕ
	    |
	    |ВЫБРАТЬ
	    |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	    |	ВременнаяТаблицаПерерасчет.Организация,
	    |	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	    |	ВременнаяТаблицаПерерасчет.Услуга,
	    |	ВременнаяТаблицаПерерасчет.МесяцНачисления,
	    |	ВременнаяТаблицаПерерасчет.Сумма,
	    |	ВременнаяТаблицаПерерасчет.Период,
	    |	ВЫБОР
	    |		КОГДА ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
	    |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Корректировка)
	    |		ИНАЧЕ ВременнаяТаблицаПерерасчет.ВидНачисления
	    |	КОНЕЦ
	    |ИЗ
	    |	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет";
		
	Запрос.УстановитьПараметр("Период", ДокументСсылкаКорректировкаНачислений.МоментВремени());
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоЛицевымСчетам", РезультатЗапроса[1].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасчетыПоЛицевымСчетам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.Сумма КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.Услуга КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.Льгота,
	|	ВременнаяТаблицаПерерасчет.Льготчик КАК ПотребительУслуг,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.МесяцНачисления,
	|	НАЧАЛОПЕРИОДА(ВременнаяТаблицаПерерасчет.ПериодКорректировки, МЕСЯЦ) КАК ДатаНачалаПериода,
	|	КОНЕЦПЕРИОДА(ВременнаяТаблицаПерерасчет.ПериодКорректировки, МЕСЯЦ) КАК ДатаОкончанияПериода,
	|	ВременнаяТаблицаПерерасчет.Корректировка
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасшифровкаНачисленияЛьгот", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуРасшифровкаЛьгот()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоЛьготам КАК Контрагент,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоЛьготам КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Льгота)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоЛьготам,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоЛьготам";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоЛьготам", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоЛьготам()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги КАК Услуга,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК Период,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоСубсидиям КАК Контрагент,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоСубсидиям КАК ДоговорКонтрагента
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ВидУслуги,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.КонтрагентДляРасчетаПоСубсидиям,
	|	ВременнаяТаблицаПерерасчет.ДоговорДляРасчетаПоСубсидиям";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыПоСубсидиям", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаПерерасчет.Организация КАК Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	СУММА(ВременнаяТаблицаПерерасчет.Сумма) КАК Сумма,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки КАК МесяцНачисления,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.Услуга,
	|	ВременнаяТаблицаПерерасчет.Период
	|ИЗ
	|	ВременнаяТаблицаПерерасчет КАК ВременнаяТаблицаПерерасчет
	|ГДЕ
	|	ВременнаяТаблицаПерерасчет.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Субсидия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПерерасчет.Организация,
	|	ВременнаяТаблицаПерерасчет.ВидНачисления,
	|	ВременнаяТаблицаПерерасчет.ПериодКорректировки,
	|	ВременнаяТаблицаПерерасчет.Период,
	|	ВременнаяТаблицаПерерасчет.ЛицевойСчет,
	|	ВременнаяТаблицаПерерасчет.Услуга";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГарантированныеСубсидии", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаВзаиморасчетыПоСубсидиям()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктСверкиКорректировки.Услуга,
		|	АктСверкиКорректировки.Ссылка.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА АктСверкиКорректировки.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		|			ТОГДА АктСверкиКорректировки.СуммаКорректировки
		|		ИНАЧЕ -АктСверкиКорректировки.СуммаКорректировки
		|	КОНЕЦ КАК Сумма,
		|	НАЧАЛОПЕРИОДА(АктСверкиКорректировки.Ссылка.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
		|	АктСверкиКорректировки.Ссылка.Дата КАК ПериодКорректировки,
		|	ВЫБОР
		|		КОГДА НЕ АктСверкиКорректировки.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА АктСверкиКорректировки.Услуга.Организация
		|		ИНАЧЕ АктСверкиКорректировки.Ссылка.Организация
		|	КОНЕЦ КАК Организация,
		|	АктСверкиКорректировки.Ссылка.Дата КАК Период,
		|	АктСверкиКорректировки.ВидНачисления КАК ВидНачисления,
		|	АктСверкиКорректировки.Услуга.ВидУслуги КАК ВидУслуги,
		|	АктСверкиКорректировки.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам КАК КонтрагентДляРасчетаПоЛьготам,
		|	АктСверкиКорректировки.Услуга.ВидУслуги.ДоговорДляРасчетаПоЛьготам КАК ДоговорДляРасчетаПоЛьготам,
		|	АктСверкиКорректировки.Услуга.ВидУслуги.КонтрагентДляРасчетаПоСубсидиям КАК КонтрагентДляРасчетаПоСубсидиям,
		|	АктСверкиКорректировки.Услуга.ВидУслуги.ДоговорДляРасчетаПоСубсидиям КАК ДоговорДляРасчетаПоСубсидиям,
		|	ИСТИНА КАК Корректировка,
		|	АктСверкиКорректировки.Льгота КАК Льгота,
		|	АктСверкиКорректировки.Льготчик КАК Льготчик,
		|	АктСверкиКорректировки.Разница
		|ПОМЕСТИТЬ ВременнаяТаблицаПерерасчет
		|ИЗ
		|	Документ.АктСверки.Корректировки КАК АктСверкиКорректировки
		|ГДЕ
		|	АктСверкиКорректировки.Ссылка = &Ссылка";
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаКорректировкаНачислений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуРасчетыПоЛицевымСчетам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоЛьготам(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицуРасшифровкаЛьгот(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоСубсидиям(ДокументСсылкаКорректировкаНачислений, СтруктураДополнительныеСвойства);
	
КонецПроцедуры





		//"ВЫБРАТЬ
		//|	АктСверкиКорректировки.Услуга,
		//|	АктСверки.ЛицевойСчет,
		//|	ВЫБОР
		//|		КОГДА АктСверки.Ссылка.ВидНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыНачислений.Начисление)
		//|			ТОГДА АктСверки.Ссылка.СуммаКорректировки
		//|		ИНАЧЕ -АктСверки.Ссылка.СуммаКорректировки
		//|	КОНЕЦ КАК Сумма,
		//|	НАЧАЛОПЕРИОДА(АктСверки.ПериодНачисления, МЕСЯЦ) КАК МесяцНачисления,
		//|	АктСверки.Ссылка.Дата КАК ПериодКорректировки,
		//|	ВЫБОР
		//|		КОГДА НЕ АктСверки.Услуга.Организация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
		//|			ТОГДА АктСверки.Услуга.Организация
		//|		ИНАЧЕ АктСверки.Ссылка.Организация
		//|	КОНЕЦ КАК Организация,
		//|	АктСверки.Ссылка.Дата КАК Период,
		//|	АктСверки.ВидНачисления КАК ВидНачисления,
		//|	АктСверки.Ссылка.Услуга.ВидУслуги КАК ВидУслуги,
		//|	АктСверки.Ссылка.Услуга.ВидУслуги.КонтрагентДляРасчетаПоЛьготам КАК КонтрагентДляРасчетаПоЛьготам,
		//|	АктСверки.Ссылка.Услуга.ВидУслуги.ДоговорДляРасчетаПоЛьготам КАК ДоговорДляРасчетаПоЛьготам,
		//|	АктСверки.Ссылка.Услуга.ВидУслуги.КонтрагентДляРасчетаПоСубсидиям КАК КонтрагентДляРасчетаПоСубсидиям,
		//|	АктСверки.Ссылка.Услуга.ВидУслуги.ДоговорДляРасчетаПоСубсидиям КАК ДоговорДляРасчетаПоСубсидиям,
		//|	АктСверки.Льгота,
		//|	АктСверки.Льготчик,
		//|	ИСТИНА КАК Корректировка
		//|ПОМЕСТИТЬ ВременнаяТаблицаПерерасчет
		//|ИЗ
		//|	Документ.АктСверки.Корректировки КАК КорректировкаНачисленийЛицевыеСчета
		//|ГДЕ
		//|	КорректировкаНачисленийЛицевыеСчета.Ссылка = &Ссылка";
